18.07.09
- sqllite
    - basic
    - Join
    - dump

![56](https://user-images.githubusercontent.com/38183218/42988895-3a7f514a-8c39-11e8-8dfd-f295cfe459cb.png)

In [1]:
import sqlite3

- What is SQLite?
    - Open Source Database(Free)
    - Serverless(Direct I/O)
    - Self-contained(Embedded)
    - Single Disk File(Cross-platform)
    - Zero-configuration(No setup, No server)
    - Supports RDBMS Features(ACID, SQL Syntax, Transactions, etc)

    - 가볍고 직접 입출력(파일형태로 제공해 언어와 붙이는 커넥터 필요없다)
    - 파일 하나당 데이터베이스 하나
    - 파일 입출력하니까 사용자 개념 필요 없음
    - RDBMS의 대부분 기능 제공
    - 심지어 파이썬에 내장

In [3]:
sqlite3.version #Version of this module

'2.6.0'

In [4]:
sqlite3.sqlite_version #Version of run time SQLite

'3.21.0'

In [3]:
conn = sqlite3.connect(':memory:')  #메모리로 작업

In [4]:
conn #여기까지 과정이 너무 simple함

In [5]:
cur = conn.cursor()

![78](https://user-images.githubusercontent.com/38183218/42988896-3aa30248-8c39-11e8-9bf3-9da1ec500ce7.png)

In [18]:
type(cur) #execute, executemany, executescript, fetch

sqlite3.Cursor

__Data type of SQLite__ -> 간편하지만 porting 시 문제
![79](https://user-images.githubusercontent.com/38183218/42988898-3ac74b12-8c39-11e8-9c70-4b828c78acfa.png)

In [7]:
cur.execute('create table people (name_last, age)')

In [11]:
who = 'Yeltsin'
age = 72

- excute
- excutemany
- excutescript

- fetchone
- fetchmany
- fetchall

In [13]:
#This is the qmark style:
cur.execute('insert into people values (?, ?)', (who, age))

In [14]:
#While this is the named style:
cur.execute('select * from people where name_last=:who and age=:age', {'who':who,'age':age})

In [16]:
print(cur.fetchone()) #데이터의 한 row를 pop

('Yeltsin', 72)

In [17]:
print(cur.fetchone())

None

In [18]:
sql = 'insert into people values (?, ?)'
curData = [('A', 1), ('B', 2), ('C', 3)]

cur.executemany(sql, curData)

In [19]:
cur.execute('select * from people')
print(cur.fetchall())

[('A', 1), ('B', 2), ('C', 3), ('A', 1), ('B', 2), ('C', 3), ('A', 1), ('B', 2), ('C', 3), ('A', 1), ('B', 2), ('C', 3), ('A', 1), ('B', 2), ('C', 3)]

In [14]:
cur.executescript(
"""
    create table person(
        first_name text primary key,
        last_name text not null
    );
    
    insert into person values('name', 'kim');
""")
#select 는 쓰지말자

In [15]:
cur.execute('select * from person')
print(cur.fetchall())

[('name', 'kim')]

In [20]:
conn.close()

In [21]:
conn = sqlite3.connect("test.db") #db하나 통째로 파일로 제공

In [24]:
conn = sqlite3.connect('create.db')
print('Opened db successfully')
 
conn.execute('''
    create table company(
        ID INT PRIMARY KEY NOT NULL,
        NAME TEXT NOT NULL,
        AGE INT NOT NULL,
        ADDRESS CHAR(50),
        SALARY REAL);
''')
print('Table created successfully')

Opened db successfully
Table created successfully

In [25]:
conn.execute(
"""
INSERT INTO company VALUES (1, 'Paul', 32, 'California', 20000.00);""")

In [26]:
conn.execute('INSERT INTO company VALUES (:id, :name, :age, :address, :salary)',
            {'id':2, 'name':'Allen', 'age':25, 'address':'Texas', 'salary':15000.00})

In [27]:
data = [(3, 'Teddy', 23, 'Norway', 200000.00),
       (4,'Mark',25,'Rich-mond',65000.00)]
conn.executemany("insert into company values (?,?,?,?,?)",data)

In [28]:
conn.executescript("""
    insert into company values (5, 'Mark1',25,'Rich-mond', 65000.00);
    insert into company values (6, 'Mark2',25,'Rich-mond',65000.00);
""")

In [29]:
conn.commit()

In [36]:
temp = conn.execute('select * from company')

In [37]:
type(temp) #cursor 직접 받지않아도 conn이 자동적으로 cursor 가져옴

sqlite3.Cursor

In [38]:
for row in temp: #숨겨진 fetchone
    print(row)

(1, 'Paul', 32, 'California', 20000.0)
(2, 'Allen', 25, 'Texas', 15000.0)
(3, 'Teddy', 23, 'Norway', 200000.0)
(4, 'Mark', 25, 'Rich-mond', 65000.0)
(5, 'Mark1', 25, 'Rich-mond', 65000.0)
(6, 'Mark2', 25, 'Rich-mond', 65000.0)

In [39]:
cid = 1
conn.execute('update company set SALARY = 25000.00 where ID = :id',
             {'id':cid})
conn.commit()

In [42]:
conn.execute('delete from company where id=2')
conn.commit()

### 예제

In [1]:
import sqlite3 as sql

In [2]:
con = None

try:
    con = sql.connect('test.db')
    cur  = con.cursor()
    cur.execute('SELECT SQLITE_VERSION()')
    data = cur.fetchone()
    print('SQLite Version: ',data)
except Exception as e:
    print('Error:',e)
finally:
    if con:
        con.close()

SQLite Version:  ('3.21.0',)

In [3]:
con = sql.connect('test.db')
cars = [
    (1, 'Audi',52642),
    (2, 'Mercedes', 57127),
    (3, 'Skoda',9000),
    (4, 'Volvo',29000),
    (5,'Bentley',350000),
    (6,'Hummer',41400),
    (7, 'Volkswagen',21600)
]

with con:
    cur = con.cursor()
    cur.execute('create table Cars (Id INT Primary key, Name TEXT, Price INT)')
    cur.executemany('INSERT INTO Cars VALUES (?, ?, ?)', cars)

In [4]:
try:
    con = sql.connect('test.db')
    cur = con.cursor()
    cur.executescript("""
        drop table if exists Cars;
        create table Cars (Id INT Primary key, Name TEXT, Price INT);
        insert into Cars values (1,'Audi',52642);
        insert into Cars values (2, 'Mercedes', 57127);
        insert into Cars values (3, 'Skoda',9000);
        insert into Cars values (4, 'Volvo',29000);
        insert into Cars values (5,'Bentley',350000);
        insert into Cars values (6,'Hummer',41400);
        insert into Cars values (7, 'Volkswagen',21600);
    """)
    lid = cur.lastrowid
    print('The last Id of the inserted row is',lid)
    
    con.commit()
    
except Exception as e:
    if con:
        con.rollback()
        
    print('Error: ',e)
finally:
    if con:
        con.close()

The last Id of the inserted row is None

In [5]:
con = sql.connect('test.db')

with con:
    cur = con.cursor()
    cur.execute('select * from Cars')
    
    while True:
        row = cur.fetchone()
        if row==None:
            break
        
        print(row[0],row[1],row[2])

1 Audi 52642
2 Mercedes 57127
3 Skoda 9000
4 Volvo 29000
5 Bentley 350000
6 Hummer 41400
7 Volkswagen 21600

In [6]:
con = sql.connect('test.db')

with con:
    con.row_factory = sql.Row
    
    cur = con.cursor()
    cur.execute('select * from Cars')
    
    rows  = cur.fetchall()
    
    for row in rows:
        print(row['Id'], row['Name'], row['Price'])

1 Audi 52642
2 Mercedes 57127
3 Skoda 9000
4 Volvo 29000
5 Bentley 350000
6 Hummer 41400
7 Volkswagen 21600

In [7]:
uId = 1
uPrice = 62300

con = sql.connect('test.db')

with con:
    cur = con.cursor()
    cur.execute('UPDATE Cars set Price=? Where Id =?', (uPrice,uId))
    print('Number of rows updated',cur.rowcount)

Number of rows updated 1

In [8]:
uId = 4

con = sql.connect('test.db')

with con:
    cur = con.cursor()
    cur.execute('SELECT Name, Price FROM Cars WHERE Id=:Id',{'Id':uId})
    row = cur.fetchone()
    print(row[0], row[1])

Volvo 29000

In [2]:
import sqlite3 as sql

In [6]:
conn = sql.connect('test4.db')

In [7]:
cur = conn.cursor() #명시적으로 할당해주는게 우선은 좋음

In [8]:
#create tables
cur.executescript(
    """
    CREATE table Artist(
        id integer primary key autoincrement,
        name text
    );
    CREATE table Genre(
        id integer primary key autoincrement,
        name text
    );
    CREATE table Album(
        id integer primary key autoincrement,
        title text,
        artist_id integer
    );
    CREATE table Track(
        id integer primary key autoincrement,
        title text,
        length integer,
        rating integer,
        count integer,
        album_id integer,
        genre_id integer
    );
    """
)

In [9]:
#insert values
cur.executescript(
    """
    INSERT into Artist (name) values('Led Zepplin');
    INSERT into Artist (name) values('AC/DC');
    INSERT into Genre (name) values ('Rock');
    INSERT into Genre (name) values ('Metal');
    INSERT into Album (title, artist_id) values ('Who Made Who', 2);
    INSERT into Album (title, artist_id) values ('IV', 1);
    INSERT into Track (title, rating, length, count, album_id, genre_id) values ('Black Dog', 5, 297, 0, 2, 1);
    INSERT into Track (title, rating, length, count, album_id, genre_id) values ('Stairway', 5, 482, 0, 2, 1);
    INSERT into Track (title, rating, length, count, album_id, genre_id) values ('About to Rock', 5, 313, 0, 1, 2);
    INSERT into Track (title, rating, length, count, album_id, genre_id) values ('Who Made Who', 5, 207, 0, 1, 2);
    """
)

In [10]:
#select 
cur.execute('SELECT * from Artist')

In [11]:
artists = cur.fetchall()
type(artists)

list

In [12]:
for artist in artists:
    print(artist)

(1, 'Led Zepplin')
(2, 'AC/DC')

#### CROSS JOIN

In [13]:
cur.execute('SELECT * from artist, album')
# or 
cur.execute('select * from artist cross join album')
# or 
cur.execute('select * from artist join album') #기본적으로 cross join

In [14]:
for row in cur.fetchall():
    print(row)

(1, 'Led Zepplin', 1, 'Who Made Who', 2)
(1, 'Led Zepplin', 2, 'IV', 1)
(2, 'AC/DC', 1, 'Who Made Who', 2)
(2, 'AC/DC', 2, 'IV', 1)

#### INNER JOIN

In [15]:
cur.execute('select a.name, ab.title from artist as a join album as ab on a.id=ab.artist_id')

In [16]:
for row in cur.fetchall():
    print(row)

('AC/DC', 'Who Made Who')
('Led Zepplin', 'IV')

In [17]:
cur.execute('select ab.title, t.title from album as ab join track as t on ab.id=t.album_id')

In [18]:
for row in cur.fetchall():
    print(row)

('IV', 'Black Dog')
('IV', 'Stairway')
('Who Made Who', 'About to Rock')
('Who Made Who', 'Who Made Who')

In [19]:
cur.execute('select * from track join album join genre join artist\
                        on track.album_id=album.id and \
                        track.genre_id=genre.id and\
                        album.artist_id=artist.id')

In [20]:
for row in cur.fetchall():
    print(row)

(1, 'Black Dog', 297, 5, 0, 2, 1, 2, 'IV', 1, 1, 'Rock', 1, 'Led Zepplin')
(2, 'Stairway', 482, 5, 0, 2, 1, 2, 'IV', 1, 1, 'Rock', 1, 'Led Zepplin')
(3, 'About to Rock', 313, 5, 0, 1, 2, 1, 'Who Made Who', 2, 2, 'Metal', 2, 'AC/DC')
(4, 'Who Made Who', 207, 5, 0, 1, 2, 1, 'Who Made Who', 2, 2, 'Metal', 2, 'AC/DC')

#### dump

In [21]:
with open('dump.sql','w') as f:
    for line in conn.iterdump(): 
        f.write('%s\n' % line)

In [22]:
conn.close()

In [23]:
data = None
with open('dump.sql','r') as f:
    data = f.read()
print(data)

BEGIN TRANSACTION;
CREATE TABLE Album(
        id integer primary key autoincrement,
        title text,
        artist_id integer
    );
INSERT INTO "Album" VALUES(1,'Who Made Who',2);
INSERT INTO "Album" VALUES(2,'IV',1);
CREATE TABLE Artist(
        id integer primary key autoincrement,
        name text
    );
INSERT INTO "Artist" VALUES(1,'Led Zepplin');
INSERT INTO "Artist" VALUES(2,'AC/DC');
CREATE TABLE Genre(
        id integer primary key autoincrement,
        name text
    );
INSERT INTO "Genre" VALUES(1,'Rock');
INSERT INTO "Genre" VALUES(2,'Metal');
CREATE TABLE Track(
        id integer primary key autoincrement,
        title text,
        length integer,
        rating integer,
        count integer,
        album_id integer,
        genre_id integer
    );
INSERT INTO "Track" VALUES(1,'Black Dog',297,5,0,2,1);
INSERT INTO "Track" VALUES(2,'Stairway',482,5,0,2,1);
INSERT INTO "Track" VALUES(3,'About to Rock',313,5,0,1,2);
INSERT INTO "Track" VALUES(4,'Who Made Who',207,5,0,1,2);
DELETE FROM "sqlite_sequence";
INSERT INTO "sqlite_sequence" VALUES('Artist',2);
INSERT INTO "sqlite_sequence" VALUES('Genre',2);
INSERT INTO "sqlite_sequence" VALUES('Album',2);
INSERT INTO "sqlite_sequence" VALUES('Track',4);
COMMIT;

In [28]:
conn2 = sql.connect('test5.db')
cur = conn2.cursor()

In [29]:
cur.executescript(data) #dump문 실행가능

In [30]:
conn2.close()

#### Left Right Join

In [31]:
conn = sql.connect('test4.db')
with conn:
    cur = conn.cursor()
    cur.execute('insert into track (title) values ("nothing")')
    cur.execute('select * from track left join album on track.album_id = album.id')
    for row in cur.fetchall():
        print(row)

(1, 'Black Dog', 297, 5, 0, 2, 1, 2, 'IV', 1)
(2, 'Stairway', 482, 5, 0, 2, 1, 2, 'IV', 1)
(3, 'About to Rock', 313, 5, 0, 1, 2, 1, 'Who Made Who', 2)
(4, 'Who Made Who', 207, 5, 0, 1, 2, 1, 'Who Made Who', 2)
(5, 'nothing', None, None, None, None, None, None, None, None)

In [32]:
conn = sql.connect('test4.db')

with conn:
    cur = conn.cursor()
    cur.execute('insert into track (title) values ("nothing")')
    #현재 right join 지원안함
    cur.execute('select * from album left join track on track.album_id = album.id')
    for row in cur.fetchall():
        print(row)

(1, 'Who Made Who', 2, 3, 'About to Rock', 313, 5, 0, 1, 2)
(1, 'Who Made Who', 2, 4, 'Who Made Who', 207, 5, 0, 1, 2)
(2, 'IV', 1, 1, 'Black Dog', 297, 5, 0, 2, 1)
(2, 'IV', 1, 2, 'Stairway', 482, 5, 0, 2, 1)